nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/driver_examples/cadc/expansion_mux_aux_opamp_err051396/pin_mux.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MC56F80748
package_id: MC56F80748VLH
mcu_data: ksdk2_0
processor_version: 0.12.7
board: MC56F80000-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: QSCI0, signal: RXD, pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1}
  - {pin_num: '5', peripheral: QSCI0, signal: TXD, pin_signal: GPIOC2/TXD0/XB_OUT11/XB_IN2/CLKO0}
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {pin_num: '14', peripheral: OPAMPA, signal: 'IN, 0', pin_signal: GPIOA1/ANA1/CMPA_IN0/OPAMPA_IN0}
  - {pin_num: '8', peripheral: OPAMPA, signal: OUT, pin_signal: GPIOC4/TA1/CMPB_O/XB_IN8/OPAMPA_OUT}
  - {pin_num: '13', peripheral: ADC, signal: 'ANA, 0', pin_signal: GPIOA0/ANA0/CMPA_IN3/OPAMPA_IN3/CMPC_O}
  - {pin_num: '36', peripheral: OPAMPB, signal: OUT, pin_signal: GPIOF0/XB_IN6/OPAMPB_OUT}
  - {pin_num: '24', peripheral: OPAMPB, signal: 'IN, 3', pin_signal: GPIOB0/ANB0/CMPB_IN3/OPAMPB_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOA0 (pin 13) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_A0_ANA0_and_CMPA_IN3_and_OPAMPA_IN3);
    /* Enable peripheral functionality on pin GPIOA1 (pin 14) */
    GPIO_PinSetPeripheralMode(BOARD_OPA_P_GPIO, BOARD_OPA_P_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB0 (pin 24) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_EXTAL_GPIO, BOARD_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_TXD0_GPIO, BOARD_Boot_TXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C2_TXD0);
    /* Enable peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_RXD0_GPIO, BOARD_Boot_RXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C3_RXD0);
    /* Enable peripheral functionality on pin GPIOC4 (pin 8) */
    GPIO_PinSetPeripheralMode(BOARD_OPA_OUT_GPIO, BOARD_OPA_OUT_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC4 (pin 8) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C4_OPAMPA_OUT);
    /* Enable peripheral functionality on pin GPIOF0 (pin 36) */
    GPIO_PinSetPeripheralMode(BOARD_OPB_OUT_GPIO, BOARD_OPB_OUT_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF0 (pin 36) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F0_OPAMPB_OUT);

    /* Internal Peripheral Select */
    /* Select SCI0_RXD Input.: Select SCI0_RXD Input, GPIOC3 or GPIOC8 or GPIOF8. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI0_RXDInputIndex, kSIM_SCI0_RXDInput_GPIOC3_GPIOC8_GPIOF8);

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
